In [2]:
import pandas as pd

In [4]:
list = input("Enter list of elements : ").split(" ")
series = pd.Series(list)
print(series)

Enter list of elements :  hello hi world

0    hello
1       hi
2    world
dtype: object

In [10]:
dates = pd.date_range(start="2021-05-01",end="2021-05-12",inclusive="neither")
for date in dates:
    print(date)

2021-05-02 00:00:00
2021-05-03 00:00:00
2021-05-04 00:00:00
2021-05-05 00:00:00
2021-05-06 00:00:00
2021-05-07 00:00:00
2021-05-08 00:00:00
2021-05-09 00:00:00
2021-05-10 00:00:00
2021-05-11 00:00:00

In [13]:
data = {'Name':["Alice","Bob","Charlie"],'Age':[25,30,35],'City':["New York","Los Angeles","Chicago"]}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [15]:
df = pd.read_csv("medals.csv")
print(df)

       Countries  gold_medals
0  United States           45
1  Great Britain           27
2          China           24
3         Russia           19
4        Germany           17

In [21]:
data = {'Name':["Alice","Bob","Charlie"],'Age':[25,30,35],'City':["New York","Los Angeles","Chicago"]}
df = pd.DataFrame(data)
sorted_df = df.sort_values(by=['Age'], ascending=[False])
print(sorted_df)

      Name  Age         City
2  Charlie   35      Chicago
1      Bob   30  Los Angeles
0    Alice   25     New York

In [28]:
selectedRows = df.head(1)
print(selectedRows)

    Name  Age      City
0  Alice   25  New York

In [35]:
df = pd.DataFrame({
    'Name':['Abhay','Vishnu','Varun','Vivek','Nimil'],
    'Occupation':['Teacher','Lawyer','Engineer','Teacher','Accountant'],
    'Salary':[10000,20000,15000,75000,12500]
})

avgSalary = df.groupby('Occupation')['Salary'].mean()
print(avgSalary)

Occupation
Accountant    12500.0
Engineer      15000.0
Lawyer        20000.0
Teacher       42500.0
Name: Salary, dtype: float64

In [38]:
import numpy as np
df = pd.DataFrame({'Numbers' : [1,2,np.nan,4,np.nan]})
df.fillna(0,inplace=True)

print(df)

   Numbers
0      1.0
1      2.0
2      0.0
3      4.0
4      0.0

In [46]:
df = pd.DataFrame({
    'CName':['Accenture','IBM','TCS','Deloitte','Tata Elxsi'],
    'Profit':[100,200,300,-400,500]
})

print(df)
print("\n")

df['Profit'] = df['Profit'].apply(lambda x : True if x > 0 else False)
print(df)

        CName  Profit
0   Accenture     100
1         IBM     200
2         TCS     300
3    Deloitte    -400
4  Tata Elxsi     500


        CName  Profit
0   Accenture    True
1         IBM    True
2         TCS    True
3    Deloitte   False
4  Tata Elxsi    True

In [50]:
data1 = {
    'eid' : [101,102,103,104],
    'ename' : ['Alice','Bob','Charlie','David'],
    'stipend' : [500,600,550,700]
}

data2 = {
    'eid' : [101,102,104,105],
    'designation' : ['Engineer', 'Doctor', 'Doctor', 'Teacher']
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

merged_df = pd.merge(df1,df2,on="eid",how="left")
merged_df.rename(columns={'designation':'position'},inplace=True)
print(merged_df)

   eid    ename  stipend  position
0  101    Alice      500  Engineer
1  102      Bob      600    Doctor
2  103  Charlie      550       NaN
3  104    David      700    Doctor